redis_benchmark/test/withKubearmor4_1000000.txt
====== GET ======
  1000000 requests completed in 11.92 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.119 milliseconds (cumulative count 2)
50.000% <= 0.295 milliseconds (cumulative count 514110)
75.000% <= 0.303 milliseconds (cumulative count 757455)
87.500% <= 0.319 milliseconds (cumulative count 900824)
93.750% <= 0.351 milliseconds (cumulative count 940251)
96.875% <= 0.415 milliseconds (cumulative count 969430)
98.438% <= 0.463 milliseconds (cumulative count 985561)
99.219% <= 0.575 milliseconds (cumulative count 992275)
99.609% <= 0.679 milliseconds (cumulative count 996139)
99.805% <= 0.799 milliseconds (cumulative count 998087)
99.902% <= 0.919 milliseconds (cumulative count 999061)
99.951% <= 1.031 milliseconds (cumulative count 999512)
99.976% <= 1.103 milliseconds (cumulative count 999759)
99.988% <= 1.223 milliseconds (cumulative count 999888)
99.994% <= 1.439 milliseconds (cumulative count 999940)
99.997% <= 1.511 milliseconds (cumulative count 999970)
99.998% <= 1.759 milliseconds (cumulative count 999993)
100.000% <= 1.767 milliseconds (cumulative count 999999)
100.000% <= 1.783 milliseconds (cumulative count 1000000)
100.000% <= 1.783 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.004% <= 0.207 milliseconds (cumulative count 41)
75.745% <= 0.303 milliseconds (cumulative count 757455)
96.506% <= 0.407 milliseconds (cumulative count 965063)
98.908% <= 0.503 milliseconds (cumulative count 989077)
99.407% <= 0.607 milliseconds (cumulative count 994069)
99.649% <= 0.703 milliseconds (cumulative count 996493)
99.820% <= 0.807 milliseconds (cumulative count 998201)
99.898% <= 0.903 milliseconds (cumulative count 998980)
99.946% <= 1.007 milliseconds (cumulative count 999461)
99.976% <= 1.103 milliseconds (cumulative count 999759)
99.986% <= 1.207 milliseconds (cumulative count 999855)
99.993% <= 1.303 milliseconds (cumulative count 999930)
99.993% <= 1.407 milliseconds (cumulative count 999932)
99.996% <= 1.503 milliseconds (cumulative count 999959)
99.997% <= 1.607 milliseconds (cumulative count 999973)
100.000% <= 1.807 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 83906.70 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.306     0.112     0.295     0.375     0.527     1.783