redis_benchmark/test/withKubearmor8_1000000.txt
====== GET ======
  1000000 requests completed in 12.02 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.119 milliseconds (cumulative count 1)
50.000% <= 0.303 milliseconds (cumulative count 707189)
75.000% <= 0.311 milliseconds (cumulative count 842188)
87.500% <= 0.319 milliseconds (cumulative count 888978)
93.750% <= 0.351 milliseconds (cumulative count 937634)
96.875% <= 0.423 milliseconds (cumulative count 969782)
98.438% <= 0.479 milliseconds (cumulative count 984462)
99.219% <= 0.599 milliseconds (cumulative count 992245)
99.609% <= 0.679 milliseconds (cumulative count 996148)
99.805% <= 0.799 milliseconds (cumulative count 998095)
99.902% <= 0.911 milliseconds (cumulative count 999034)
99.951% <= 1.023 milliseconds (cumulative count 999520)
99.976% <= 1.199 milliseconds (cumulative count 999759)
99.988% <= 1.655 milliseconds (cumulative count 999878)
99.994% <= 2.399 milliseconds (cumulative count 999939)
99.997% <= 3.519 milliseconds (cumulative count 999970)
99.998% <= 3.807 milliseconds (cumulative count 999985)
99.999% <= 4.007 milliseconds (cumulative count 999993)
100.000% <= 4.103 milliseconds (cumulative count 999997)
100.000% <= 4.159 milliseconds (cumulative count 999999)
100.000% <= 4.199 milliseconds (cumulative count 1000000)
100.000% <= 4.199 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.004% <= 0.207 milliseconds (cumulative count 37)
70.719% <= 0.303 milliseconds (cumulative count 707189)
96.128% <= 0.407 milliseconds (cumulative count 961285)
98.623% <= 0.503 milliseconds (cumulative count 986228)
99.304% <= 0.607 milliseconds (cumulative count 993040)
99.658% <= 0.703 milliseconds (cumulative count 996579)
99.823% <= 0.807 milliseconds (cumulative count 998226)
99.899% <= 0.903 milliseconds (cumulative count 998986)
99.948% <= 1.007 milliseconds (cumulative count 999485)
99.968% <= 1.103 milliseconds (cumulative count 999682)
99.977% <= 1.207 milliseconds (cumulative count 999765)
99.983% <= 1.303 milliseconds (cumulative count 999830)
99.987% <= 1.407 milliseconds (cumulative count 999865)
99.987% <= 1.503 milliseconds (cumulative count 999870)
99.987% <= 1.607 milliseconds (cumulative count 999873)
99.988% <= 1.703 milliseconds (cumulative count 999880)
99.991% <= 1.807 milliseconds (cumulative count 999911)
99.992% <= 1.903 milliseconds (cumulative count 999917)
99.992% <= 2.007 milliseconds (cumulative count 999923)
99.993% <= 2.103 milliseconds (cumulative count 999927)
99.995% <= 3.103 milliseconds (cumulative count 999950)
100.000% <= 4.103 milliseconds (cumulative count 999997)
100.000% <= 5.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 83160.09 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.309     0.112     0.303     0.383     0.551     4.199